from untitled import extract_text_from_docx

def remove_stopwords(text, stop_words_set):
    words = text.split()  # Разбиваем текст на слова
    filtered_words = [word for word in words if word.lower() not in stop_words_set]  # Убираем стоп-слова
    return " ".join(filtered_words)  # Собираем обратно в строку

# Путь к Word файлу
file_path = "output.docx"

# Извлекаем текст
text = extract_text_from_docx(file_path)
print("Извлеченный текст:")

stop_words_set = {"я", "ты", "он", "она", "оно", "мы", "вы", "они", "это", "тот", "та", "те", "который", "чей", "кто", "что", 
              "да", "нет", "а", "но", "и", "или", "да", "также", "же", "не", "ли", "бы", "для", "от", "из", "с", "на", 
              "в", "по", "к", "у", "о", "об", "при", "для", "за", "перед", "после", "до", "через", "между", "над", 
              "под", "вокруг", "без", "из-за", "около", "через", "вон", "про", "между", "если", "когда", "пока", "хотя", 
              "как", "так", "потому что", "чтобы", "ибо", "то есть", "где", "когда", "куда", "откуда", "уж", "вот", "вот такой", 
              "именно", "вот это", "тот", "всё", "вся", "все", "некоторый", "несколько", "один", "два", "три", "первый", "второй", 
              "последний", "каждый", "любой", "любой", "даже", "довольно", "вовсе", "только", "никогда", "всегда", "потом", "когда-то", 
              "везде", "впрочем", "мало", "много", "больше", "меньше", "слишком", "скорее", "уж", "как бы", "например", "например", 
              "возможно", "следует", "конечно", "вроде", "чем", "что-то", "тот", "этот", "такой", "никакой", "другой", "так как", 
              "а вот", "пусть", "либо", "просто", "типо", "короче", "хотя бы", "и так далее", "далее", "есть", "потому", "то"
}


filtered_text = remove_stopwords(text, stop_words_set)
print(filtered_text)

